In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [2]:
df_april=pd.read_csv('uber-raw-data-apr14.csv')
df_april.head()

          Date/Time      Lat      Lon    Base
0  04-01-2014 00:11  40.7690 -73.9549  B02512
1  04-01-2014 00:17  40.7267 -74.0345  B02512
2  04-01-2014 00:21  40.7316 -73.9873  B02512
3  04-01-2014 00:28  40.7588 -73.9776  B02512
4  04-01-2014 00:33  40.7594 -73.9722  B02512

In [5]:
df_may=pd.read_csv('uber-raw-data-may14.csv')
df_may.head()

          Date/Time      Lat      Lon    Base
0  5/1/2014 0:02:00  40.7521 -73.9914  B02512
1  5/1/2014 0:06:00  40.6965 -73.9715  B02512
2  5/1/2014 0:15:00  40.7464 -73.9838  B02512
3  5/1/2014 0:17:00  40.7463 -74.0011  B02512
4  5/1/2014 0:17:00  40.7594 -73.9734  B02512

In [14]:
df_jun=pd.read_csv('uber-raw-data-jun14.csv')
df_jun.head()

          Date/Time      Lat      Lon    Base
0  6/1/2014 0:00:00  40.7293 -73.9920  B02512
1  6/1/2014 0:01:00  40.7131 -74.0097  B02512
2  6/1/2014 0:04:00  40.3461 -74.6610  B02512
3  6/1/2014 0:04:00  40.7555 -73.9833  B02512
4  6/1/2014 0:07:00  40.6880 -74.1831  B02512

In [16]:
df_jul=pd.read_csv('uber-raw-data-jul14.csv')
df_jul.head()

          Date/Time      Lat      Lon    Base
0  7/1/2014 0:03:00  40.7586 -73.9706  B02512
1  7/1/2014 0:05:00  40.7605 -73.9994  B02512
2  7/1/2014 0:06:00  40.7320 -73.9999  B02512
3  7/1/2014 0:09:00  40.7635 -73.9793  B02512
4  7/1/2014 0:20:00  40.7204 -74.0047  B02512

In [22]:
df_aug=pd.read_csv('uber-raw-data-aug14.csv')
df_aug.head()

                       .753  -74.0039  B02617
8/15/2014 19:40:00  40.7599  -73.9964  B02617
8/15/2014 19:40:00  40.7204  -73.9633  B02617
8/15/2014 19:40:00  40.7631  -73.9683  B02617
8/15/2014 19:40:00  40.7279  -73.9493  B02617
8/15/2014 19:40:00  40.7341  -73.9879  B02617

In [23]:
df_sep=pd.read_csv('uber-raw-data-sep14.csv')
df_sep.head()

          Date/Time      Lat      Lon    Base
0  9/1/2014 0:01:00  40.2201 -74.0021  B02512
1  9/1/2014 0:01:00  40.7500 -74.0027  B02512
2  9/1/2014 0:03:00  40.7559 -73.9864  B02512
3  9/1/2014 0:06:00  40.7450 -73.9889  B02512
4  9/1/2014 0:11:00  40.8145 -73.9444  B02512

1. Number of rides as per the day.

In [10]:
def rides_per_day(df):
    df['Date/Time']=pd.to_datetime(df['Date/Time'])
    df['Date']=df['Date/Time'].apply(lambda time:time.strftime("%d-%m-%Y"))
    return df['Date'].sort_values().value_counts()

For April Month

In [11]:
rides_per_day(df_april)

26-04-2014    10886
25-04-2014    10766
24-04-2014     9626
04-04-2014     8978
23-04-2014     8484
17-04-2014     8291
15-04-2014     7718
11-04-2014     7575
10-04-2014     7335
18-04-2014     7107
12-04-2014     6995
03-04-2014     6981
22-04-2014     6974
05-04-2014     6817
16-04-2014     6786
07-04-2014     6712
27-04-2014     6443
09-04-2014     5979
19-04-2014     5933
02-04-2014     5862
08-04-2014     5804
28-04-2014     5758
21-04-2014     5336
01-04-2014     4749
14-04-2014     4743
06-04-2014     4648
13-04-2014     4586
20-04-2014     4289
30-04-2014     2186
29-04-2014     1487
28-04-2020        1
Name: Date, dtype: int64

For May Month

In [12]:
rides_per_day(df_may)

13-09-2014    43205
05-09-2014    42319
19-09-2014    41017
06-09-2014    40520
18-09-2014    40274
12-09-2014    39540
27-09-2014    39468
20-09-2014    38864
04-09-2014    38360
25-09-2014    38203
26-09-2014    37504
11-09-2014    36439
16-09-2014    36092
10-09-2014    35910
17-09-2014    35531
09-09-2014    34560
30-09-2014    33431
03-09-2014    32631
24-09-2014    31301
08-09-2014    30360
23-09-2014    30316
07-09-2014    30134
28-09-2014    29656
15-09-2014    29454
29-09-2014    29201
02-09-2014    28831
21-09-2014    28620
22-09-2014    28312
14-09-2014    28122
01-09-2014    19961
Name: Date, dtype: int64

for june month

In [19]:
rides_per_day(df_jun)

13-06-2014    31207
12-06-2014    29844
19-06-2014    28594
26-06-2014    28516
05-06-2014    28371
25-06-2014    26460
11-06-2014    25716
27-06-2014    24895
06-06-2014    24683
18-06-2014    24647
20-06-2014    24271
09-06-2014    23244
10-06-2014    22874
04-06-2014    22831
03-06-2014    22674
17-06-2014    21807
28-06-2014    21208
07-06-2014    20889
24-06-2014    20779
21-06-2014    19940
14-06-2014    19327
30-06-2014    18395
16-06-2014    17778
23-06-2014    17735
02-06-2014    17503
29-06-2014    17107
22-06-2014    16322
01-06-2014    15967
08-06-2014    15749
15-06-2014    14511
Name: Date, dtype: int64

for July month

In [20]:
rides_per_day(df_jul)

23-07-2014    34073
15-07-2014    33845
31-07-2014    33541
24-07-2014    32050
30-07-2014    30740
17-07-2014    30710
10-07-2014    30541
25-07-2014    29975
18-07-2014    29860
22-07-2014    29029
11-07-2014    28752
16-07-2014    28607
09-07-2014    27817
26-07-2014    27708
29-07-2014    27589
14-07-2014    27350
02-07-2014    26480
12-07-2014    25936
08-07-2014    25763
19-07-2014    25726
28-07-2014    23981
21-07-2014    23578
27-07-2014    22590
03-07-2014    21597
01-07-2014    21228
20-07-2014    21212
13-07-2014    21082
07-07-2014    18280
04-07-2014    14148
06-07-2014    11443
05-07-2014    10890
Name: Date, dtype: int64

for September month

In [25]:
rides_per_day(df_sep)

13-09-2014    43205
05-09-2014    42319
19-09-2014    41017
06-09-2014    40520
18-09-2014    40274
12-09-2014    39540
27-09-2014    39468
20-09-2014    38864
04-09-2014    38360
25-09-2014    38203
26-09-2014    37504
11-09-2014    36439
16-09-2014    36092
10-09-2014    35910
17-09-2014    35531
09-09-2014    34560
30-09-2014    33431
03-09-2014    32631
24-09-2014    31301
08-09-2014    30360
23-09-2014    30316
07-09-2014    30134
28-09-2014    29656
15-09-2014    29454
29-09-2014    29201
02-09-2014    28831
21-09-2014    28620
22-09-2014    28312
14-09-2014    28122
01-09-2014    19961
Name: Date, dtype: int64

2. Number of rides per a base.

In [26]:
df_april['Base'].sort_values().value_counts()

B02598    160298
B02512     35536
Name: Base, dtype: int64

In [27]:
df_may['Base'].sort_values().value_counts()

B02617    377695
B02598    240600
B02682    197138
B02764    178333
B02512     34370
Name: Base, dtype: int64

In [29]:
df_jun['Base'].sort_values().value_counts()

B02598    242975
B02682    194926
B02617    184460
B02512     32509
B02764      8974
Name: Base, dtype: int64

In [30]:
df_jul['Base'].sort_values().value_counts()

B02617    310160
B02598    245597
B02682    196754
B02512     35021
B02764      8589
Name: Base, dtype: int64

In [32]:
df_sep['Base'].sort_values().value_counts()

B02617    377695
B02598    240600
B02682    197138
B02764    178333
B02512     34370
Name: Base, dtype: int64

3. Total number of rides from April to September.

In [33]:
def all_info(df):
    print(df.shape)
    df.info()

In [34]:
all_info(df_april)

(195835, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195835 entries, 0 to 195834
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  195835 non-null  datetime64[ns]
 1   Lat        195834 non-null  float64
 2   Lon        195834 non-null  float64
 3   Base       195834 non-null  object
 4   Date       195835 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 7.5+ MB

In [35]:
all_info(df_may)

(1028136, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028136 entries, 0 to 1028135
Data columns (total 5 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   Date/Time  1028136 non-null  datetime64[ns]
 1   Lat        1028136 non-null  float64
 2   Lon        1028136 non-null  float64
 3   Base       1028136 non-null  object
 4   Date       1028136 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 39.2+ MB

In [36]:
all_info(df_jun)

(663844, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 663844 entries, 0 to 663843
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  663844 non-null  datetime64[ns]
 1   Lat        663844 non-null  float64
 2   Lon        663844 non-null  float64
 3   Base       663844 non-null  object
 4   Date       663844 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 25.3+ MB

In [37]:
all_info(df_jul)

(796121, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 796121 entries, 0 to 796120
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  796121 non-null  datetime64[ns]
 1   Lat        796121 non-null  float64
 2   Lon        796121 non-null  float64
 3   Base       796121 non-null  object
 4   Date       796121 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 30.4+ MB

In [38]:
all_info(df_aug)

(396907, 3)
<class 'pandas.core.frame.DataFrame'>
Index: 396907 entries, 8/15/2014 19:40:00 to 8/31/2014 23:59:00
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   .753      396907 non-null  float64
 1   -74.0039  396907 non-null  float64
 2   B02617    396907 non-null  object
dtypes: float64(2), object(1)
memory usage: 12.1+ MB

In [39]:
all_info(df_sep)

(1028136, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028136 entries, 0 to 1028135
Data columns (total 5 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   Date/Time  1028136 non-null  datetime64[ns]
 1   Lat        1028136 non-null  float64
 2   Lon        1028136 non-null  float64
 3   Base       1028136 non-null  object
 4   Date       1028136 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 39.2+ MB

In [40]:
df1=df_april.merge(df_may,how='outer')

In [41]:
df1=df_april.merge(df_may,how='outer')

In [43]:
df1=df1.merge(df_jul,how='outer')

In [45]:
df1=df1.merge(df_sep,how='outer')

In [46]:
df1.shape

(2068434, 5)

In [47]:
print('Total number of uber rides from april to september: ',len(df1))

Total number of uber rides from april to september:  2068434

4. Number of rides per hours.

In [48]:
df1['Hours']=df1['Date/Time'].apply(lambda date:date.hour)
df1['Hours'].sort_index().value_counts()

17    151024
18    150998
19    138817
16    138699
20    131028
21    125726
15    122542
22    107157
14    106227
13     91114
8      87428
7      86154
12     78865
11     77323
23     74841
9      74703
10     73939
6      64549
0      47604
5      39236
1      31274
4      25313
3      22256
2      21617
Name: Hours, dtype: int64

5. Highest number of rides for Base.

In [52]:
print('Base with highest number of rides:',df1['Base'].value_counts().max())

Base with highest number of rides: 709923